app/controllers/payments_controller.rb

  def update_estimated_amount
    if @payment.update_attributes(params[:payment])
---
UPDATE "payments" SET estimated_amount = 793.333333333333 WHERE ("payments"."id" IN (146,147,149,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180))