app/controllers/payments_controller.rb

UPDATE "estimated_payments" SET estimated_amount = 6.27 WHERE ("estimated_payments"."id" IN (1,2,3,7,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36))
---
  def update_amount
    if @estimated_payment.update_attributes(params[:payment])

INSERT INTO "payments" ("created_at", "check_number", "estimated_payment_id", "updated_at", "type", "paid_at") VALUES('2011-04-15 10:16:41', '', NULL, '2011-04-15 10:16:41', 'Payment::Transfer', '2011-04-14 00:00:00')
---
  def pay_for
    type = params[:payment].delete(:type)
    if type == 'check'
      @payment = Payment::Check.new(params[:payment])
    elsif type == 'transfer'
      @payment = Payment::Transfer.new(params[:payment])
    end
    @payment.estimated_payment_id = @estimated_payment.id

    if @payment.save

SELECT * FROM "estimated_payments" WHERE ("estimated_payments".schedule_id = 20) AND ( "estimated_payments".payment_id IS NOT NULL )
SELECT * FROM "payments" WHERE ("payments".schedule_id = 19) AND ("payments".status = 'u')
---
  def find_payment
    @estimated_payment = EstimatedPayment.find(params[:id])