app/controllers/schedules_controller.rb

SELECT * FROM "estimated_payments" WHERE ("estimated_payments".schedule_id = 21) AND ( "estimated_payments".payment_id IS NOT NULL )
SELECT * FROM "payments" WHERE ("payments"."id" IN (6,7,8,1,2,3,4,5))
SELECT * FROM "schedules" WHERE ("schedules"."id" = 1)
---
  def show
    @schedule = Schedule::Base.find(params[:id], :include => { :estimated_payments => :payment })

INSERT INTO "schedules" ("first_payment_at", "annual_amount", "type") VALUES('2011-04-14 00:00:00', 20000.0, NULL)
---
  def create
    type = params[:schedule].delete(:type)
    if type.constantize.superclass == Schedule::Base
      @schedule = type.constantize.new(params[:schedule])
      if @schedule.save